zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54607J256BD208-pinctrl.h
#define PINT_PINT4_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT5_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT7_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define SCT0_OUT1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 4) /* PIO1_8 */
#define SD_CLK_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 2) /* PIO1_8 */
#define ADC0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define CTIMER1_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define DMA0_TRIG0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG10_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG11_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG12_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG13_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG14_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG15_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG16_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG17_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG18_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG20_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG21_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG22_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG23_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG24_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG25_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG26_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG27_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG28_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG29_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG8_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG9_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define EMC_CASN_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 6) /* PIO1_9 */
#define FC1_SCK_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 2) /* PIO1_9 */
#define FC4_CTS_SDA_SSEL0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 5) /* PIO1_9 */
#define GPIO_PIO19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define SCT0_OUT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 4) /* PIO1_9 */
#define ADC0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC0_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define CTIMER1_MATCH0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 3) /* PIO1_10 */
#define DMA0_TRIG0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG10_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG11_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG12_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG13_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG14_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG15_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG16_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG17_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG18_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG19_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG20_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG21_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG22_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG23_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG24_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG25_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG26_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG27_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG28_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG29_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG8_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG9_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define EMC_RASN_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 6) /* PIO1_10 */
#define FC1_RXD_SDA_MOSI_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 2) /* PIO1_10 */
#define GPIO_PIO110_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define SCT0_OUT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 4) /* PIO1_10 */
#define ADC0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC0_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER1_CAPTURE1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA0_TRIG0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG10_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG11_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG12_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG13_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG14_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG15_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG16_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG17_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG18_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG19_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG20_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG21_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG22_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG23_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG24_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG25_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG26_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG27_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG28_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG29_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG4_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG5_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG6_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG7_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG8_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG9_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define EMC_EMC_CLK0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 6) /* PIO1_11 */
#define FC1_TXD_SCL_MISO_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 2) /* PIO1_11 */
#define GPIO_PIO111_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT4_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT5_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT6_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT7_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define USB0_VBUS_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 4) /* PIO1_11 */
#define ADC0_TRIG1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define ADC0_TRIG2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define CTIMER1_MATCH1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 3) /* PIO1_12 */
#define DMA0_TRIG0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG10_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG11_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG12_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG13_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG14_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG15_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG16_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG17_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG18_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG19_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG20_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG21_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG22_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG23_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG24_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG25_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG26_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG27_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG28_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG29_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG4_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG5_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG6_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG7_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG8_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG9_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define EMC_EMC_DYCS0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 6) /* PIO1_12 */
#define FC6_SCK_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 2) /* PIO1_12 */
#define GPIO_PIO112_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT4_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT5_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT6_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT7_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define USB0_PORTPWRN_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 4) /* PIO1_12 */
#define ADC0_TRIG1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define ADC0_TRIG2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER1_CAPTURE2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA0_TRIG0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG10_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG11_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG12_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG13_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG14_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG15_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG16_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG17_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG18_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG19_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG20_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG21_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG22_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG23_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG24_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG25_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG26_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG27_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG28_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG29_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG8_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG9_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define EMC_EMC_DQM0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 6) /* PIO1_13 */
#define FC6_RXD_SDA_MOSI_DATA_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 2) /* PIO1_13 */
#define GPIO_PIO113_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define USB0_FRAME_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 5) /* PIO1_13 */
#define USB0_OVERCURRENTN_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 4) /* PIO1_13 */
#define ADC0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC0_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define CTIMER1_MATCH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 3) /* PIO1_14 */
#define DMA0_TRIG0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG10_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG11_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG12_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG13_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG14_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG15_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG16_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG17_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG18_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG19_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG20_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG21_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG22_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG23_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG24_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG25_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG26_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG27_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG28_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG29_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG8_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG9_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define EMC_EMC_DQM1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 6) /* PIO1_14 */
#define FC5_CTS_SDA_SSEL0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 4) /* PIO1_14 */
#define GPIO_PIO114_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define USB0_UP_LED_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 5) /* PIO1_14 */
#define UTICK0_CAPTURE2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 2) /* PIO1_14 */
#define ADC0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC0_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER1_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA0_TRIG0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG10_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG11_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG12_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG13_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG14_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG15_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG16_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG17_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG18_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG19_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG20_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG21_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG22_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG23_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG24_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG25_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG26_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG27_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG28_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG29_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG8_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG9_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define EMC_EMC_CKE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 6) /* PIO1_15 */
#define FC4_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 5) /* PIO1_15 */
#define FC5_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 4) /* PIO1_15 */
#define GPIO_PIO115_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define UTICK0_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 2) /* PIO1_15 */
#define ADC0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define CTIMER1_MATCH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 3) /* PIO1_16 */
#define DMA0_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG10_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG11_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
