zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54607J256BD208-pinctrl.h
#define DMA0_TRIG19_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG20_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG21_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG22_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG23_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG24_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG25_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG26_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG27_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG28_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG29_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG8_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG9_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define EMC_EMC_D14_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 6) /* PIO1_30 */
#define FC7_TXD_SCL_MISO_WS_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 1) /* PIO1_30 */
#define GPIO_PIO130_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT0_IN0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SDIF_SD_D7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 2) /* PIO1_30 */
#define USB1_OVERCURRENTN_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 4) /* PIO1_30 */
#define USB1_UP_LED_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 5) /* PIO1_30 */
#define ADC0_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC0_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define CTIMER0_MATCH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 3) /* PIO1_31 */
#define DMA0_TRIG0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG10_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG11_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG12_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG13_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG14_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG16_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG17_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG18_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG19_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG20_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG21_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG22_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG23_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG24_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG25_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG26_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG27_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG28_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG29_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG8_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG9_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define EMC_EMC_D15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 6) /* PIO1_31 */
#define FC8_CTS_SDA_SSEL0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 5) /* PIO1_31 */
#define GPIO_PIO131_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define MCLK_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 1) /* PIO1_31 */
#define PINT_PINT0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define SCT0_OUT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 4) /* PIO1_31 */
#define ADC0_CH7_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 0) /* PIO2_0 */
#define CTIMER1_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define FC0_RXD_SDA_MOSI_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 2) /* PIO2_0 */
#define GPIO_PIO20_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 0) /* PIO2_0 */
#define ADC0_CH8_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 0) /* PIO2_1 */
#define CTIMER1_MATCH0_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 4) /* PIO2_1 */
#define FC0_TXD_SCL_MISO_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 2) /* PIO2_1 */
#define GPIO_PIO21_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 0) /* PIO2_1 */
#define CTIMER1_MATCH1_PIO2_2 IOCON_MUX(66, IOCON_TYPE_D, 4) /* PIO2_2 */
#define FC3_SSEL3_PIO2_2 IOCON_MUX(66, IOCON_TYPE_D, 2) /* PIO2_2 */
#define GPIO_PIO22_PIO2_2 IOCON_MUX(66, IOCON_TYPE_D, 0) /* PIO2_2 */
#define SCT0_OUT6_PIO2_2 IOCON_MUX(66, IOCON_TYPE_D, 3) /* PIO2_2 */
#define CTIMER2_MATCH0_PIO2_3 IOCON_MUX(67, IOCON_TYPE_D, 4) /* PIO2_3 */
#define FC1_RXD_SDA_MOSI_PIO2_3 IOCON_MUX(67, IOCON_TYPE_D, 3) /* PIO2_3 */
#define GPIO_PIO23_PIO2_3 IOCON_MUX(67, IOCON_TYPE_D, 0) /* PIO2_3 */
#define SD_CLK_PIO2_3 IOCON_MUX(67, IOCON_TYPE_D, 2) /* PIO2_3 */
#define CTIMER2_MATCH1_PIO2_4 IOCON_MUX(68, IOCON_TYPE_D, 4) /* PIO2_4 */
#define FC1_TXD_SCL_MISO_PIO2_4 IOCON_MUX(68, IOCON_TYPE_D, 3) /* PIO2_4 */
#define GPIO_PIO24_PIO2_4 IOCON_MUX(68, IOCON_TYPE_D, 0) /* PIO2_4 */
#define SD_CMD_PIO2_4 IOCON_MUX(68, IOCON_TYPE_D, 2) /* PIO2_4 */
#define CTIMER1_MATCH2_PIO2_5 IOCON_MUX(69, IOCON_TYPE_D, 4) /* PIO2_5 */
#define FC1_CTS_SDA_SSEL0_PIO2_5 IOCON_MUX(69, IOCON_TYPE_D, 3) /* PIO2_5 */
#define GPIO_PIO25_PIO2_5 IOCON_MUX(69, IOCON_TYPE_D, 0) /* PIO2_5 */
#define SD_POW_EN_PIO2_5 IOCON_MUX(69, IOCON_TYPE_D, 2) /* PIO2_5 */
#define CTIMER0_CAPTURE0_PIO2_6 IOCON_MUX(70, IOCON_TYPE_D, 4) /* PIO2_6 */
#define FC1_RTS_SCL_SSEL1_PIO2_6 IOCON_MUX(70, IOCON_TYPE_D, 3) /* PIO2_6 */
#define GPIO_PIO26_PIO2_6 IOCON_MUX(70, IOCON_TYPE_D, 0) /* PIO2_6 */
#define SDIF_SD_D0_PIO2_6 IOCON_MUX(70, IOCON_TYPE_D, 2) /* PIO2_6 */
#define CTIMER0_CAPTURE1_PIO2_7 IOCON_MUX(71, IOCON_TYPE_D, 4) /* PIO2_7 */
#define GPIO_PIO27_PIO2_7 IOCON_MUX(71, IOCON_TYPE_D, 0) /* PIO2_7 */
#define SDIF_SD_D1_PIO2_7 IOCON_MUX(71, IOCON_TYPE_D, 2) /* PIO2_7 */
#define SYSCON_FREQMEB_PIO2_7 IOCON_MUX(71, IOCON_TYPE_D, 3) /* PIO2_7 */
#define CTIMER0_MATCH0_PIO2_8 IOCON_MUX(72, IOCON_TYPE_D, 4) /* PIO2_8 */
#define GPIO_PIO28_PIO2_8 IOCON_MUX(72, IOCON_TYPE_D, 0) /* PIO2_8 */
#define SDIF_SD_D2_PIO2_8 IOCON_MUX(72, IOCON_TYPE_D, 2) /* PIO2_8 */
#define CTIMER0_MATCH1_PIO2_9 IOCON_MUX(73, IOCON_TYPE_D, 4) /* PIO2_9 */
#define GPIO_PIO29_PIO2_9 IOCON_MUX(73, IOCON_TYPE_D, 0) /* PIO2_9 */
#define SDIF_SD_D3_PIO2_9 IOCON_MUX(73, IOCON_TYPE_D, 2) /* PIO2_9 */
#define GPIO_PIO210_PIO2_10 IOCON_MUX(74, IOCON_TYPE_D, 0) /* PIO2_10 */
#define SD_CARD_DET_N_PIO2_10 IOCON_MUX(74, IOCON_TYPE_D, 2) /* PIO2_10 */
#define FC5_SCK_PIO2_11 IOCON_MUX(75, IOCON_TYPE_D, 5) /* PIO2_11 */
#define GPIO_PIO211_PIO2_11 IOCON_MUX(75, IOCON_TYPE_D, 0) /* PIO2_11 */
#define LCD_PWR_PIO2_11 IOCON_MUX(75, IOCON_TYPE_D, 1) /* PIO2_11 */
#define SDIF_SD_VOLT0_PIO2_11 IOCON_MUX(75, IOCON_TYPE_D, 2) /* PIO2_11 */
#define FC5_RXD_SDA_MOSI_PIO2_12 IOCON_MUX(76, IOCON_TYPE_D, 5) /* PIO2_12 */
#define GPIO_PIO212_PIO2_12 IOCON_MUX(76, IOCON_TYPE_D, 0) /* PIO2_12 */
#define LCD_LE_PIO2_12 IOCON_MUX(76, IOCON_TYPE_D, 1) /* PIO2_12 */
#define SDIF_SD_VOLT1_PIO2_12 IOCON_MUX(76, IOCON_TYPE_D, 2) /* PIO2_12 */
#define USB0_IDVALUE_PIO2_12 IOCON_MUX(76, IOCON_TYPE_D, 3) /* PIO2_12 */
#define FC5_TXD_SCL_MISO_PIO2_13 IOCON_MUX(77, IOCON_TYPE_D, 5) /* PIO2_13 */
#define GPIO_PIO213_PIO2_13 IOCON_MUX(77, IOCON_TYPE_D, 0) /* PIO2_13 */
#define LCD_DCLK_PIO2_13 IOCON_MUX(77, IOCON_TYPE_D, 1) /* PIO2_13 */
#define SDIF_SD_VOLT2_PIO2_13 IOCON_MUX(77, IOCON_TYPE_D, 2) /* PIO2_13 */
#define CTIMER0_MATCH2_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 4) /* PIO2_14 */
#define FC5_CTS_SDA_SSEL0_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 5) /* PIO2_14 */
#define GPIO_PIO214_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 0) /* PIO2_14 */
#define LCD_FP_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 1) /* PIO2_14 */
#define USB0_FRAME_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 2) /* PIO2_14 */
#define USB0_PORTPWRN_PIO2_14 IOCON_MUX(78, IOCON_TYPE_D, 3) /* PIO2_14 */
#define CTIMER0_MATCH3_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 4) /* PIO2_15 */
#define FC5_RTS_SCL_SSEL1_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 5) /* PIO2_15 */
#define GPIO_PIO215_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 0) /* PIO2_15 */
#define LCD_AC_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 1) /* PIO2_15 */
#define USB0_OVERCURRENTN_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 3) /* PIO2_15 */
#define USB0_UP_LED_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 2) /* PIO2_15 */
#define CTIMER1_MATCH3_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 4) /* PIO2_16 */
#define FC8_SCK_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 5) /* PIO2_16 */
#define GPIO_PIO216_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 0) /* PIO2_16 */
#define LCD_LP_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 1) /* PIO2_16 */
#define USB1_FRAME_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 2) /* PIO2_16 */
#define USB1_PORTPWRN_PIO2_16 IOCON_MUX(80, IOCON_TYPE_D, 3) /* PIO2_16 */
#define CTIMER1_CAPTURE1_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 4) /* PIO2_17 */
#define FC8_RXD_SDA_MOSI_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 5) /* PIO2_17 */
#define GPIO_PIO217_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 0) /* PIO2_17 */
#define LCD_CLKIN_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 1) /* PIO2_17 */
#define USB1_OVERCURRENTN_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 3) /* PIO2_17 */
#define USB1_UP_LED_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 2) /* PIO2_17 */
#define CTIMER3_MATCH0_PIO2_18 IOCON_MUX(82, IOCON_TYPE_D, 4) /* PIO2_18 */
#define FC3_RXD_SDA_MOSI_PIO2_18 IOCON_MUX(82, IOCON_TYPE_D, 2) /* PIO2_18 */
#define FC7_SCK_PIO2_18 IOCON_MUX(82, IOCON_TYPE_D, 3) /* PIO2_18 */
#define GPIO_PIO218_PIO2_18 IOCON_MUX(82, IOCON_TYPE_D, 0) /* PIO2_18 */
#define LCD_LCD_VD0_PIO2_18 IOCON_MUX(82, IOCON_TYPE_D, 1) /* PIO2_18 */
#define CTIMER3_MATCH1_PIO2_19 IOCON_MUX(83, IOCON_TYPE_D, 4) /* PIO2_19 */
#define FC3_TXD_SCL_MISO_PIO2_19 IOCON_MUX(83, IOCON_TYPE_D, 2) /* PIO2_19 */
#define FC7_RXD_SDA_MOSI_DATA_PIO2_19 IOCON_MUX(83, IOCON_TYPE_D, 3) /* PIO2_19 */
#define GPIO_PIO219_PIO2_19 IOCON_MUX(83, IOCON_TYPE_D, 0) /* PIO2_19 */
#define LCD_LCD_VD1_PIO2_19 IOCON_MUX(83, IOCON_TYPE_D, 1) /* PIO2_19 */
#define CTIMER3_MATCH2_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 4) /* PIO2_20 */
#define CTIMER4_CAPTURE0_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 5) /* PIO2_20 */
#define FC3_RTS_SCL_SSEL1_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 2) /* PIO2_20 */
#define FC7_TXD_SCL_MISO_WS_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 3) /* PIO2_20 */
#define GPIO_PIO220_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 0) /* PIO2_20 */
#define LCD_LCD_VD2_PIO2_20 IOCON_MUX(84, IOCON_TYPE_D, 1) /* PIO2_20 */
#define CTIMER3_MATCH3_PIO2_21 IOCON_MUX(85, IOCON_TYPE_D, 4) /* PIO2_21 */
#define FC3_CTS_SDA_SSEL0_PIO2_21 IOCON_MUX(85, IOCON_TYPE_D, 2) /* PIO2_21 */
#define GPIO_PIO221_PIO2_21 IOCON_MUX(85, IOCON_TYPE_D, 0) /* PIO2_21 */
#define LCD_LCD_VD3_PIO2_21 IOCON_MUX(85, IOCON_TYPE_D, 1) /* PIO2_21 */
#define MCLK_PIO2_21 IOCON_MUX(85, IOCON_TYPE_D, 3) /* PIO2_21 */
#define CTIMER2_CAPTURE0_PIO2_22 IOCON_MUX(86, IOCON_TYPE_D, 4) /* PIO2_22 */
#define GPIO_PIO222_PIO2_22 IOCON_MUX(86, IOCON_TYPE_D, 0) /* PIO2_22 */
#define LCD_LCD_VD4_PIO2_22 IOCON_MUX(86, IOCON_TYPE_D, 1) /* PIO2_22 */
#define SCT0_OUT7_PIO2_22 IOCON_MUX(86, IOCON_TYPE_D, 2) /* PIO2_22 */
#define GPIO_PIO223_PIO2_23 IOCON_MUX(87, IOCON_TYPE_D, 0) /* PIO2_23 */
#define LCD_LCD_VD5_PIO2_23 IOCON_MUX(87, IOCON_TYPE_D, 1) /* PIO2_23 */
#define SCT0_OUT8_PIO2_23 IOCON_MUX(87, IOCON_TYPE_D, 2) /* PIO2_23 */
#define GPIO_PIO224_PIO2_24 IOCON_MUX(88, IOCON_TYPE_D, 0) /* PIO2_24 */
#define LCD_LCD_VD6_PIO2_24 IOCON_MUX(88, IOCON_TYPE_D, 1) /* PIO2_24 */
#define SCT0_OUT9_PIO2_24 IOCON_MUX(88, IOCON_TYPE_D, 2) /* PIO2_24 */
#define GPIO_PIO225_PIO2_25 IOCON_MUX(89, IOCON_TYPE_D, 0) /* PIO2_25 */
#define LCD_LCD_VD7_PIO2_25 IOCON_MUX(89, IOCON_TYPE_D, 1) /* PIO2_25 */
#define USB0_VBUS_PIO2_25 IOCON_MUX(89, IOCON_TYPE_D, 2) /* PIO2_25 */
#define CTIMER2_CAPTURE1_PIO2_26 IOCON_MUX(90, IOCON_TYPE_D, 4) /* PIO2_26 */
#define FC3_SCK_PIO2_26 IOCON_MUX(90, IOCON_TYPE_D, 3) /* PIO2_26 */
#define GPIO_PIO226_PIO2_26 IOCON_MUX(90, IOCON_TYPE_D, 0) /* PIO2_26 */
#define LCD_LCD_VD8_PIO2_26 IOCON_MUX(90, IOCON_TYPE_D, 1) /* PIO2_26 */
#define FC3_SSEL2_PIO2_27 IOCON_MUX(91, IOCON_TYPE_D, 3) /* PIO2_27 */
#define FC9_SCK_PIO2_27 IOCON_MUX(91, IOCON_TYPE_D, 2) /* PIO2_27 */
#define GPIO_PIO227_PIO2_27 IOCON_MUX(91, IOCON_TYPE_D, 0) /* PIO2_27 */
#define LCD_LCD_VD9_PIO2_27 IOCON_MUX(91, IOCON_TYPE_D, 1) /* PIO2_27 */
#define CTIMER2_CAPTURE2_PIO2_28 IOCON_MUX(92, IOCON_TYPE_D, 4) /* PIO2_28 */
#define FC7_CTS_SDA_SSEL0_PIO2_28 IOCON_MUX(92, IOCON_TYPE_D, 2) /* PIO2_28 */
#define GPIO_PIO228_PIO2_28 IOCON_MUX(92, IOCON_TYPE_D, 0) /* PIO2_28 */
#define LCD_LCD_VD10_PIO2_28 IOCON_MUX(92, IOCON_TYPE_D, 1) /* PIO2_28 */
#define CLKOUT_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 5) /* PIO2_29 */
#define CTIMER2_CAPTURE3_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 4) /* PIO2_29 */
#define FC7_RTS_SCL_SSEL1_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 2) /* PIO2_29 */
#define FC8_TXD_SCL_MISO_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 3) /* PIO2_29 */
#define GPIO_PIO229_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 0) /* PIO2_29 */
#define LCD_LCD_VD11_PIO2_29 IOCON_MUX(93, IOCON_TYPE_D, 1) /* PIO2_29 */
#define CTIMER2_MATCH2_PIO2_30 IOCON_MUX(94, IOCON_TYPE_D, 4) /* PIO2_30 */
#define GPIO_PIO230_PIO2_30 IOCON_MUX(94, IOCON_TYPE_D, 0) /* PIO2_30 */
#define LCD_LCD_VD12_PIO2_30 IOCON_MUX(94, IOCON_TYPE_D, 1) /* PIO2_30 */
#define GPIO_PIO231_PIO2_31 IOCON_MUX(95, IOCON_TYPE_D, 0) /* PIO2_31 */
#define LCD_LCD_VD13_PIO2_31 IOCON_MUX(95, IOCON_TYPE_D, 1) /* PIO2_31 */
#define CTIMER1_MATCH0_PIO3_0 IOCON_MUX(96, IOCON_TYPE_D, 4) /* PIO3_0 */
#define DMIC0_CLK0_PIO3_0 IOCON_MUX(96, IOCON_TYPE_D, 2) /* PIO3_0 */
#define GPIO_PIO30_PIO3_0 IOCON_MUX(96, IOCON_TYPE_D, 0) /* PIO3_0 */
#define LCD_LCD_VD14_PIO3_0 IOCON_MUX(96, IOCON_TYPE_D, 1) /* PIO3_0 */
#define CTIMER1_MATCH1_PIO3_1 IOCON_MUX(97, IOCON_TYPE_D, 4) /* PIO3_1 */
#define DMIC0_DATA0_PIO3_1 IOCON_MUX(97, IOCON_TYPE_D, 2) /* PIO3_1 */
#define GPIO_PIO31_PIO3_1 IOCON_MUX(97, IOCON_TYPE_D, 0) /* PIO3_1 */
#define LCD_LCD_VD15_PIO3_1 IOCON_MUX(97, IOCON_TYPE_D, 1) /* PIO3_1 */
#define CTIMER1_MATCH2_PIO3_2 IOCON_MUX(98, IOCON_TYPE_D, 4) /* PIO3_2 */
#define FC9_RXD_SDA_MOSI_PIO3_2 IOCON_MUX(98, IOCON_TYPE_D, 2) /* PIO3_2 */
#define GPIO_PIO32_PIO3_2 IOCON_MUX(98, IOCON_TYPE_D, 0) /* PIO3_2 */
#define LCD_LCD_VD16_PIO3_2 IOCON_MUX(98, IOCON_TYPE_D, 1) /* PIO3_2 */
#define FC9_TXD_SCL_MISO_PIO3_3 IOCON_MUX(99, IOCON_TYPE_D, 2) /* PIO3_3 */
#define GPIO_PIO33_PIO3_3 IOCON_MUX(99, IOCON_TYPE_D, 0) /* PIO3_3 */
#define LCD_LCD_VD17_PIO3_3 IOCON_MUX(99, IOCON_TYPE_D, 1) /* PIO3_3 */
#define CTIMER4_CAPTURE1_PIO3_4 IOCON_MUX(100, IOCON_TYPE_D, 4) /* PIO3_4 */
#define FC8_CTS_SDA_SSEL0_PIO3_4 IOCON_MUX(100, IOCON_TYPE_D, 3) /* PIO3_4 */
#define GPIO_PIO34_PIO3_4 IOCON_MUX(100, IOCON_TYPE_D, 0) /* PIO3_4 */
#define LCD_LCD_VD18_PIO3_4 IOCON_MUX(100, IOCON_TYPE_D, 1) /* PIO3_4 */
#define CTIMER4_MATCH1_PIO3_5 IOCON_MUX(101, IOCON_TYPE_D, 4) /* PIO3_5 */
#define FC8_RTS_SCL_SSEL1_PIO3_5 IOCON_MUX(101, IOCON_TYPE_D, 3) /* PIO3_5 */
#define GPIO_PIO35_PIO3_5 IOCON_MUX(101, IOCON_TYPE_D, 0) /* PIO3_5 */
#define LCD_LCD_VD19_PIO3_5 IOCON_MUX(101, IOCON_TYPE_D, 1) /* PIO3_5 */
#define CTIMER4_MATCH2_PIO3_6 IOCON_MUX(102, IOCON_TYPE_D, 4) /* PIO3_6 */
#define GPIO_PIO36_PIO3_6 IOCON_MUX(102, IOCON_TYPE_D, 0) /* PIO3_6 */
#define LCD_LCD_VD0_PIO3_6 IOCON_MUX(102, IOCON_TYPE_D, 2) /* PIO3_6 */
#define LCD_LCD_VD20_PIO3_6 IOCON_MUX(102, IOCON_TYPE_D, 1) /* PIO3_6 */
#define CTIMER4_CAPTURE2_PIO3_7 IOCON_MUX(103, IOCON_TYPE_D, 4) /* PIO3_7 */
#define GPIO_PIO37_PIO3_7 IOCON_MUX(103, IOCON_TYPE_D, 0) /* PIO3_7 */
#define LCD_LCD_VD1_PIO3_7 IOCON_MUX(103, IOCON_TYPE_D, 2) /* PIO3_7 */
#define LCD_LCD_VD21_PIO3_7 IOCON_MUX(103, IOCON_TYPE_D, 1) /* PIO3_7 */
#define CTIMER4_CAPTURE3_PIO3_8 IOCON_MUX(104, IOCON_TYPE_D, 4) /* PIO3_8 */
#define GPIO_PIO38_PIO3_8 IOCON_MUX(104, IOCON_TYPE_D, 0) /* PIO3_8 */
#define LCD_LCD_VD22_PIO3_8 IOCON_MUX(104, IOCON_TYPE_D, 1) /* PIO3_8 */
#define LCD_LCD_VD2_PIO3_8 IOCON_MUX(104, IOCON_TYPE_D, 2) /* PIO3_8 */
#define CTIMER0_CAPTURE2_PIO3_9 IOCON_MUX(105, IOCON_TYPE_D, 4) /* PIO3_9 */
#define GPIO_PIO39_PIO3_9 IOCON_MUX(105, IOCON_TYPE_D, 0) /* PIO3_9 */
#define LCD_LCD_VD23_PIO3_9 IOCON_MUX(105, IOCON_TYPE_D, 1) /* PIO3_9 */
#define LCD_LCD_VD3_PIO3_9 IOCON_MUX(105, IOCON_TYPE_D, 2) /* PIO3_9 */
#define CTIMER3_MATCH0_PIO3_10 IOCON_MUX(106, IOCON_TYPE_D, 3) /* PIO3_10 */
#define EMC_EMC_DYCS1_PIO3_10 IOCON_MUX(106, IOCON_TYPE_D, 6) /* PIO3_10 */
#define GPIO_PIO310_PIO3_10 IOCON_MUX(106, IOCON_TYPE_D, 0) /* PIO3_10 */
#define SCT0_OUT3_PIO3_10 IOCON_MUX(106, IOCON_TYPE_D, 1) /* PIO3_10 */
#define SWD_TRACEDATA0_PIO3_10 IOCON_MUX(106, IOCON_TYPE_D, 7) /* PIO3_10 */
#define FC0_SCK_PIO3_11 IOCON_MUX(107, IOCON_TYPE_D, 2) /* PIO3_11 */
#define FC1_SCK_PIO3_11 IOCON_MUX(107, IOCON_TYPE_D, 3) /* PIO3_11 */
#define GPIO_PIO311_PIO3_11 IOCON_MUX(107, IOCON_TYPE_D, 0) /* PIO3_11 */
#define MCLK_PIO3_11 IOCON_MUX(107, IOCON_TYPE_D, 1) /* PIO3_11 */
#define SWD_TRACEDATA3_PIO3_11 IOCON_MUX(107, IOCON_TYPE_D, 7) /* PIO3_11 */
#define CLKOUT_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 5) /* PIO3_12 */
#define CTIMER3_CAPTURE0_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 3) /* PIO3_12 */
#define EMC_EMC_CLK1_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 6) /* PIO3_12 */
#define GPIO_PIO312_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 0) /* PIO3_12 */
#define SCT0_OUT8_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 1) /* PIO3_12 */
#define TRACECLK_PIO3_12 IOCON_MUX(108, IOCON_TYPE_D, 7) /* PIO3_12 */
#define CTIMER3_CAPTURE1_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 3) /* PIO3_13 */
#define EMC_FBCK_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 6) /* PIO3_13 */
#define FC9_CTS_SDA_SSEL0_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 2) /* PIO3_13 */
#define GPIO_PIO313_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 0) /* PIO3_13 */
#define SCT0_OUT9_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 1) /* PIO3_13 */
#define SWD_TRACEDATA1_PIO3_13 IOCON_MUX(109, IOCON_TYPE_D, 7) /* PIO3_13 */
#define CTIMER3_MATCH1_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 3) /* PIO3_14 */
#define FC9_RTS_SCL_SSEL1_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 2) /* PIO3_14 */
#define GPIO_PIO314_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 0) /* PIO3_14 */
#define SCT0_OUT4_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 1) /* PIO3_14 */
#define SWD_TRACEDATA2_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 7) /* PIO3_14 */
#define FC8_SCK_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 1) /* PIO3_15 */
#define GPIO_PIO315_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 0) /* PIO3_15 */
#define SD_WR_PRT_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 2) /* PIO3_15 */
#define FC8_RXD_SDA_MOSI_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 1) /* PIO3_16 */
#define GPIO_PIO316_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 0) /* PIO3_16 */
#define SDIF_SD_D4_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 2) /* PIO3_16 */
#define FC8_TXD_SCL_MISO_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 1) /* PIO3_17 */
#define GPIO_PIO317_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 0) /* PIO3_17 */
#define SDIF_SD_D5_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 2) /* PIO3_17 */
#define CTIMER4_MATCH0_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 3) /* PIO3_18 */
#define FC8_CTS_SDA_SSEL0_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 1) /* PIO3_18 */
#define GPIO_PIO318_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 0) /* PIO3_18 */
#define SCT0_OUT5_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 5) /* PIO3_18 */
#define SDIF_SD_D6_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 2) /* PIO3_18 */
#define CTIMER4_MATCH1_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 3) /* PIO3_19 */
#define FC8_RTS_SCL_SSEL1_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 1) /* PIO3_19 */
#define GPIO_PIO319_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 0) /* PIO3_19 */
#define SCT0_OUT6_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 5) /* PIO3_19 */
#define SDIF_SD_D7_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 2) /* PIO3_19 */
#define CLKOUT_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 3) /* PIO3_20 */
#define FC9_SCK_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 1) /* PIO3_20 */
#define GPIO_PIO320_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 0) /* PIO3_20 */
#define SCT0_OUT7_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 5) /* PIO3_20 */
#define SD_CARD_INT_N_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 2) /* PIO3_20 */
#define ADC0_CH9_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 0) /* PIO3_21 */
#define CTIMER4_MATCH3_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 3) /* PIO3_21 */
#define FC9_RXD_SDA_MOSI_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 1) /* PIO3_21 */
#define GPIO_PIO321_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 0) /* PIO3_21 */
#define SD_BACKEND_PWR_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 2) /* PIO3_21 */
#define UTICK0_CAPTURE2_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 4) /* PIO3_21 */
#define ADC0_CH10_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC9_TXD_SCL_MISO_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 1) /* PIO3_22 */
#define GPIO_PIO322_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC2_CTS_SDA_SSEL0_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 1) /* PIO3_23 */
#define GPIO_PIO323_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 0) /* PIO3_23 */
#define UTICK0_CAPTURE3_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 3) /* PIO3_23 */
#define CTIMER4_CAPTURE0_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 2) /* PIO3_24 */
#define FC2_RTS_SCL_SSEL1_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 1) /* PIO3_24 */
#define GPIO_PIO324_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 0) /* PIO3_24 */
#define USB0_VBUS_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 3) /* PIO3_24 */
